IDENTIFICATION DIVISION.
PROGRAM-ID. hello.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 HELLO PIC X(6) VALUE "Hello ".
01 WORLD PIC X(6) VALUE "Mundo!".
PROCEDURE DIVISION.
CALL "say" USING HELLO WORLD.
DISPLAY "Potato potato"
STOP RUN.